; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star10 - direction
	GroundStation8 - direction
	Star7 - direction
	Star0 - direction
	Star3 - direction
	Star5 - direction
	Star9 - direction
	GroundStation2 - direction
	Star6 - direction
	GroundStation11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation11)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument3 infrared2)
	(supports instrument3 image1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star6)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(have_image Star12 image1)
	(have_image Planet13 image1)
	(have_image Phenomenon14 image1)
	(have_image Phenomenon15 infrared2)
	(have_image Planet16 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 phenomenon15 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 5
4. (take_image satellite0 phenomenon15 instrument1 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 1 of 5
5. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 5
6. (take_image satellite0 phenomenon14 instrument1 image1)
   added: (have_image phenomenon14 image1)
   goals met: 2 of 5
7. (turn_to satellite0 planet13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet13)
   goals met: 2 of 5
8. (take_image satellite0 planet13 instrument1 image1)
   added: (have_image planet13 image1)
   goals met: 3 of 5
9. (turn_to satellite0 planet16 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet16)
   goals met: 3 of 5
10. (take_image satellite0 planet16 instrument1 image1)
   added: (have_image planet16 image1)
   goals met: 4 of 5
11. (turn_to satellite0 star12 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star12)
   goals met: 4 of 5
12. (take_image satellite0 star12 instrument1 image1)
   added: (have_image star12 image1)
   goals met: 5 of 5
